[{"news_date":"2022/11/8","news_info":"Pi Founder Nicolas Kokkalis is featured in a podcast interview, where he describes his journey from decentralized systems academic research to Pi Network’s Vision: to build an inclusive peer-to-peer ecosystem and online experience, fueled by Pi, the world’s most widely distributed cryptocurrency.","content":null},{"news_date":"2022/11/19","news_info":"We’re showcasing Pi app winning projects from the recent Hackathons at top universities! Projects include games, health apps, NFT apps, apps with environmental impact and more that help broaden the types of blockchain-based apps that can be built on Pi platform and demonstrate its potential with true utility for the Pi ecosystem to mature and flourish. Tap “Hackathon projects” above to learn more about these amazing student developers and Pi’s Web3 vision.","content":"<div class=\"mt-0\">\n\t<b>大学黑客马拉松获胜者展示 Pi 网络实用程序</b>\n</div>\n<div>作为招募新开发人员的外展计划的一部分，Pi Network 自豪地赞助了 10 月 14 日至 16 日周末在哈佛大学、康奈尔大学和加州大学伯克利分校举办的三场美国编程马拉松。在那里，来自全国和世界各地的热情的学生开发人员在 Pi 的平台上开展独特的项目，并将 Pi Cryptocurrency 整合到他们的应用程序中。</div>\n<div>作为上一篇黑客马拉松博文的后续，今天我们将介绍我们的获胜团队和他们的 Pi 应用程序项目。参加 HackHarvard、BigRed//Hacks 和 CalHacks 的优秀学生每个人都有机会使用 Pi 的技术并直接向 Pi Core 团队学习。这些学生开发者利用 Pi 易于使用的平台和开发者工具，展示了只需一个周末即可开发的创意原型。这些多样化的项目标志着可以在 Pi 网络上构建的更多产品和用例的潜力，并且可以从区块链集成中受益。 Pi 的使命之一是扩大 Web3 应用程序的范围，并拓宽基于区块链的服务可以为世界上的日常生活提供什么的视野。</div>\n<div>今天，我们将重点介绍我们参观过的三场编程马拉松比赛的获胜者。团队的创新想法和 Pi 在他们的应用程序中的使用使他们脱颖而出；这些项目仅在一个周末的时间内建成，现阶段还只是原型。我们很高兴许多黑客马拉松参与者，包括下面提到的一些团队，都表示有兴趣并打算继续构建他们的 Pi 应用程序。核心团队继续为这些年轻的构建者提供技术和设计建议，目标是支持他们开发成成熟的 Pi 应用程序。</div>\n<div class=\"mt-3\">\n\t<b>获胜队伍</b>\n</div>\n<div>在每次黑客马拉松中，Pi Network 都会选出一支优秀的获胜团队，我们很高兴向您介绍他们的项目！</div>\n<div class=\"mt-3\">\n\t<b>HackHarvard 获胜者：Sus 无人机</b>\n</div>\n<div>在 HackHarvard，获胜团队将他们的精力集中在构建一个促进可持续发展的无人机系统上。 该项目名为 Sus Drones，由 Akshay Kumar、Garv Jasuja、Vijay Bhaskar Chiluveru 和 Muntaser Syed 领导，包括一架支持传感器的无人机，可以准确测量其下方土地的二氧化碳、甲烷和反照率（太阳反射率），从而更好地图表环境因素。</div>\n<div>Sus Drones 团队成员在哈佛大学获得“最佳使用 Pi SDK”奖。</div>\n<div>使用此信息，Sus Drones 可以计算农场或任何其他土地的碳排放量，并在 Pi Network 上出售相应的碳信用额度。 农民、公司和个人将能够看到他们土地上的确切碳排放量，并使用 Pi Network 平台和 Pi 硬币购买或出售他们的碳信用额度。</div>\n<div>为什么选择 Pi 网络？ Vijay Bhaskar Chiluveru 表示，Pi 是“一个令人兴奋的合作伙伴，因为它在 Web3 中具有影响力的规模和地位。” 团队成员 Akshay Kumar 补充说，他们希望利用“已经存在的明确受众和用户——加上易用性非常好，因为我们对区块链知之甚少。”</div>\n<div>Pi Network 很自豪能够通过我们易于编码的环境简化复杂的项目。 区块链不应成为创新的阻碍，我们很高兴 Sus Drones 的项目能够继续发展。</div>\n<div class=\"mt-3\">\n\t<b>Cornell BigRed/Hacks 获胜者：NFTree</b>\n</div>\n<div>另一个关注可持续性的项目是 BigRed//Hacks 的获胜团队 NFTree，由 Atiksh Bhardwaj、Collin Li、Owen Oertell 和Žiga Kovačič。</div>\n<div>NFTree 团队（康奈尔大学的）从核心团队成员 Swaroop Poudel（中）那里领奖。</div>\n<div>NFTree 是一个建立在 Pi Network 上的 NTF 项目，旨在资助和支持全球植树。 NFTree 的愿景是每个 NFTree 代表一棵真实的、独特的树，用户可以使用 Pi crypto 买卖这些代币。 NFTree 的专有算法考虑了树木的类型、位置、年龄以及环境和气候因素，为用户提供对真实树木的健康和价值的估计。 Pi Network 和 NFTree 有一些明显的协同作用；正如团队成员 Owen Oertell 指出的那样，“我们的项目专注于可持续性，而 Pi 的平台是生态友好的，因此我们希望构建一个符合我们目标的平台。”</div>\n<div>这个项目为社区和个人提供了以虚拟方式采取实际行动的能力，我们很高兴看到这个项目能长多高！</div>\n<div class=\"mt-3\">\n\t<b>CalHacks 获胜者：Sparkle</b>\n</div>\n<div>在 CalHacks，在约 2,000 名黑客的竞争领域中，Sparkle 作为一款娱乐性游戏应用程序脱颖而出，其游戏内 NFT 组件与 Pi 加密货币无缝集成。 Sparkle 团队成员 Aidana Mustafina、Arububim Roman、Merxon Yuan 和龙芯 Ajodo 创造了一种方式来吸引和娱乐我们超过 3500 万活跃用户的用户群，其核心产品可以随着时间的推移而扩展。</div>\n<div>Sparkle 团队成员向 Pi Network 创始人 Chengdiao Fan（中）和 Nicolas Kokkalis（右）展示他们的应用程序。</div>\n<div>在 Sparkle 中，用户玩放置游戏的目的是增加他们的“Sparkle”，并在达到某些成就时解锁新的关卡。 然后，玩家可以使用 Pi 硬币购买游戏内的 NFT，每个 NFT 都可以为他们的游戏玩法添加新的奖励或功能。 而且，通过将 Sparkle 放在 Pi 生态系统上，玩家随后可以将这些改变游戏规则的 NFT 道具出售给其他玩家。</div>\n<div>Team Sparkle 的 Godson Ajodo 向我们介绍了他们在 Pi 上的开发过程：“起初，我们认为创建 NFT 和 Pi 应用程序太复杂了。 但在黑客马拉松结束时，我们能够推出一个功能齐全的原型，并且惊讶于我们在一天半的时间内如此轻松地完成了这项工作！”</div>\n<div>在 Pi，我们同样对团队接下来的工作印象深刻和兴奋！</div>\n<div class=\"mt-3\">\n\t<b>美国黑客马拉松突出了 Pi 加密货币的实用性和易用性</b>\n</div>\n<div>Pi Network 拥有一个极其易于访问的平台——不仅适用于我们的成员，也适用于世界各地想要在此基础上进行构建的开发人员。 Sparkle、Sus Drones 和 NFTree 背后的开发人员利用了 Pi 的可访问技术；开发人员不需要任何先前的加密或区块链经验——构建 Pi 应用程序的简单步骤是 (1) 构建 Web 应用程序，(2) 添加 Pi JavaScript 库，以及 (3) 进行 API 调用。</div>\n<div>这些黑客能够在一个周末的时间内完成一些令人难以置信的项目的第一阶段，提供了一个经过验证的成功案例研究，我们希望其他开发人员可以从中汲取灵感。</div>\n<div>除了这些获奖者之外，其他令人印象深刻的项目在黑客马拉松过程中集成了 Pi 的技术，值得表扬。其中包括 Instafit（医疗保健和健身应用程序）、Pi Bakery（市场）和 Craft Pi（教育技术应用程序）。</div>\n<div>周末创建了如此多的相关和多样的项目，黑客们强调了 Pi 社区的用例范围以及可以从 Pi Network 上开发中受益的应用程序。</div>\n<div>正如这些黑客马拉松所表明的那样，在 Pi 平台上进行构建既优雅又简单，并且是立即访问拥有超过 3500 万会员的活跃用户群的好方法。 Pi Network 上的开发人员可以利用简单的支付和用户身份验证集成、低交易费用、环保协议和无缝用户体验，为数百万经过验证的全球社区成员创建一流的应用程序和实用程序。</div>\n<div>最好的部分？借助 Pi 简单且兼容的平台，无需专业语言或区块链特定经验即可在 Pi Network 上进行开发。</div>\n<div>先驱者，如果您想加入乐趣并在 Pi 上构建应用程序，请在 Pi 开发人员门户网站上成为 Pi 应用程序开发人员，并使用您最喜欢的 Javascript 兼容语言进行编程。如果您不知道如何自己编程但热衷于为 Pi 生态系统做出贡献，请与您的开发人员朋友合作或介绍 Pi 平台以构建基于实用程序的 Pi 应用程序。 （请注意，此链接只能在 Pi 浏览器上访问，Pi 浏览器是 Pi 移动生态系统的所在地。有关如何开发的更多详细信息，请参阅此处的 Pi Developer github。） </div>\n\n<div>我们非常期待看到大家接下来会做什么！让创新之流流动起来。</div>"},{"news_date":"2022/12/02","news_info":"On December 1, 2022, the new base mining rate becomes effective as part of its monthly adjustment based on the rewards issuance formula released on March 1, 2022. You will see the new rate when you start your first new mining session of the month. Boost your individual mining rate through diverse contributions, including Pi Lockups, App usage, Node operations, security circles, and referrals. “Read More” for details, or “Boost Mining Rate” now!","content":""},{"news_date":"2022/12/08","news_info":"The Core Team is providing a KYC update on recent progress and next steps for the KYC process. Tap “Read More” above to read in detail, as we continue to increase KYC eligibility and full application reviews to more and more Pioneers.","content":"<div><b>Pi KYC：新功能和改进的基础架构</b></div>\n<div>自我们在 7 月份进行上次更新以来，Pi Core 团队在 KYC 流程方面取得了重大进展，</div>\n<div>以 1) 提高 KYC 应用程序的有效性、效率和安全性，2) 将 KYC 扩展到越来越多的先锋，以及 3) 分析和工作 为已提交申请但尚未收到 KYC 结果的真正先驱者提供解决方案。 虽然很多这些改进，尤其是为 (1) 所做的工作，大多数先驱者无法体验，但 KYC 工作不仅是关于扩展和允许人们通过，而且还要确保实现总体 KYC 目标——让真正的先驱者 在不同国家和地区尽可能准确安全地通过 KYC，同时尽可能防止假账户。 作为核心团队的优先事项，KYC 对于通过提供可靠和安全的入职培训来确保网络的内在质量来培育充满活力的 Pi 生态系统至关重要。</div>\n<div>下面，我们将提供有关自上次 KYC 更新以来我们所做工作的更多详细信息，以及帮助先驱者了解和了解预期内容的后续步骤。</div>\n<div><b>近期重大进展</b></div>\n<div>致力于并部署更好的机器自动化来解读 ID 文件。改进的算法将能够更好地编辑人们 ID 文件上的私人信息并减少对人群验证器的暴露，同时仍然允许他们执行他们的工作（因此增加通过用户的数量 ). 这种改进可能并非对所有先锋都可见，但对于整个社区的 KYC 流程来说很重要。</div>\n<div>创建了一个系统来分析人类验证者的工作质量和统计数据。 这又是一个重要的后端无形功能，用于监控和评估人群验证者的表现并追究他们的责任，同时确保 KYC 结果尽可能准确可靠。</div>\n<div>重构验证工作选择的主要后端代码。 这种优化对最终用户也是不可见的，但对于提高验证者工作效率和获得更准确的 KYC 结果很重要。</div>\n<div>提高了 KYC 应用基础架构的效率。 这对于提高 KYC 应用程序的性能和用户体验很重要，例如 减少每个屏幕的加载时间，从而更成功地完成应用程序。</div>\n<div>改进了允许更多先驱者有资格申请的流程和分析。 这涉及到许多先驱者关心的问题：增加可以申请 KYC 的网络百分比。 此列表后的下方提供了有关此功能的更多详细信息。</div>\n<div>创建技术流程来分析 KYC 漏斗以及为什么某些应用程序会卡在漏斗中，并设计解决方案来解锁这些应用程序以达到最终目的。</div>\n<div>修复了一个问题，该问题会阻止一些已经 KYC 的先驱者看到他们的主网清单的最新版本。 成功通过 KYC 后，先驱者现在将直接发送到清单。</div>\n<div>部署了更多功能来支持整体 KYC 解决方案，例如（但不限于）针对旧设备和操作系统的自定义相机功能、用户体验增加和改进的安全措施。</div>\n<div>提高我们处理 Pioneers 更名申诉的能力，这延迟了一些 Pioneers 成功通过 KYC。 这可能是一个复杂的过程，因为它需要机器自动化（已经完成，使一些先驱者能够通过）并启用人工验证（正在进行开发并且需要处理不能由机器单独处理的名称申诉）。</div>\n<div>现有措施（例如特殊地区的暂定 KYC 和对特定卡住案例有效的重新提交）正在持续应用、监控和改进，以提高不同先锋的申请资格和更快获得结果的资格。</div>\n<div>关于增加有资格获得 KYC 的人数：我们本周将部署一项改进，将有资格申请 KYC 的先驱者的百分比再增加 18%。 如果他们通过电话号码或 Facebook 验证他们的 Pi 帐户，则另外 13% 的网络将有资格申请 KYC。 因此，如果您想申请 KYC，请确保您的帐户已通过验证！</div>\n<div><b>下一步</b></div>\n<div>对未来一段时间的 KYC 目标感到好奇吗？ 我们将提供一份简短的清单，列出我们在未来几周内为 KYC 流程所做的工作，以便不同情况下的先驱者知道会发生什么：</div>\n<div>开始但未完成 KYC 流程的先驱者将在主应用程序中收到挖矿后参与消息，以帮助和提醒他们完成申请。</div>\n<div>对于因机器自动化无法解决名称申诉而申诉更改账户名称并陷入 KYC 流程的先行者，KYC 人工验证者将能够帮助他们解决申诉并在 KYC 流程中解锁。</div>\n<div>解除阻止 56% 的应用程序在 KYC 流程中“卡住”的先驱者。 所有卡住的案例目前仅占所有已完成的 KYC 申请的 11% 左右。 （这不适用于实行特殊“暂定 KYC”的地区的先锋，因为他们遵循独立的流程）</div>\n<div>我们还在研究可能在 2023 年初发布的其他功能：</div>\n<div>KYC被拒后的上诉功能：允许目前不符合重新提交资格的被拒绝先驱者对其 KYC 结果提出上诉。 这意味着，一旦部署了此功能，被拒绝的 KYC 申请人可以提交申诉表以提供额外信息以获得另一次重新考虑的机会。</div>\n<div>手写 ID 处理：启用 KYC 流程来处理手写 ID。 目前，如果您所在国家/地区的身份证件部分是手写的，您的申请可能会被卡在审核中，因此此功能将有助于为受此问题影响的申请人提供便利。</div>\n<div><b>并行优先要做的工作</b></div>\n<div>Mainnet 当前的封闭网络时期允许 Pi Network 专注于两个优先事项：大规模 KYC 和生态系统实用程序建设。 两者都是实现我们建立可行的生态系统以为开放主网做好准备的最终目标的重要步骤。</div>\n<div>在 KYC 上，我们听到了社区的声音，我们感谢您的耐心等待，因为核心团队会尽一切努力尽快扩展 KYC。 没有整个 Pi 社区的支持，Pi Network 的目标是不可能实现的，我们再次感谢 Pi KYC 验证者为整个 KYC 流程做出的贡献。 我们希望今天的更新能为我们的努力和不久的将来带来一些启示。</div>\n<div>在实用程序构建方面，核心团队还致力于通过社区开发人员、正在进行的黑客马拉松、业务合作伙伴和我们自己来促进和支持生态系统应用程序开发。 在这里查看我们最新的 Hackathon 获奖者。</div>\n<div>随着网络的不断发展，核心团队很高兴能进入 Pi 之旅的这个阶段，因为我们看到我们集体努力的成果开始萌发成惊人的东西。</div>"},{"news_date":"2022/12/16","news_info":"Hackathons are back—Pi Network is hosting a Hackathon for Pi community developers starting January 9, 2023. What kinds of apps do you want to see built? Tap “Topics” to share your Pi Apps ideas and vote on what others are proposing as well!","content":""},{"news_date":"2022/12/21","news_info":"Want to be part of the upcoming Pi Hackathon? If you have a serious project suggestion and want to participate in building it, tap “BRAINSTORM” to open the Brainstorm app on the Pi Browser and propose your project! If you have not already downloaded the Pi Browser app, tap on “PI BROWSER” above to download and get started.","content":""},{"news_date":"2022/12/27","news_info":"lt's been a great 2022 everyone! Tap “Read Update\" tocheck out our end-of-year Tech and Product Update, wherewe describe many (but not all) of our most significantdeployments and in-progress developments since lastPi2Day.","content":"<div>欢迎来到Pi Network在2022年下半年的技术和产品更新！</div>\n<div>自 Pi2Day（2022 年 6 月 28 日）以来，Pi Core 团队在构建主网迁移、大规模 KYC、生态系统建设以及最终为下一阶段主网做准备所需的基础设施和组件方面取得了重大进展。</div>\n<div>Pi Network处于封闭式主网开发的重要阶段，Pi能够专注于两个关键优先事项：实现大规模KYC和增强生态系统公用事业建设。两者都是实现我们建立一个可行的生态系统为开放主网做好准备的目标的重要步骤。</div>\n<div>今天的更新侧重于我们所做的与先驱者相关且有趣的工作，可能会忽略 Pi Network 与接口、后端、合规性、社区成功和错误修复相关的无数工作和部署。</div>\n<div class=\"mt-3\"><b>具体项目改进</b></div>\n<div class=\"mt-3\"><b>主网迁移</b></div>\n<div>自Pi2Day（6月28日）以来，已启动大规模主网迁移。完全迁移的先驱者现在在 Pi 主网区块链上运行，并根据封闭网络的指南在 Pi 生态系统中使用 Pi（在此处阅读白皮书章节），完成主网清单的人可以将他们的可转移余额从手机应用程序迁移到他们在主网区块链上的钱包地址。</div>\n<div class=\"mt-3\"><b>主网迁移的工作有三个方面：</b></div>\n<div>1. 根据来自各种来源（如移动挖矿、KYC、主网清单、合规性等）的同步数据启用和扩展大规模迁移。</div>\n<div>2. 验证迁移在各个方面的正确性和准确性，包括（但不限于）平衡、合规性和策略违规。鉴于迁移的初期，如有必要，请将其还原;解决迁移问题，并从暂停中恢复和恢复。</div>\n<div>3. 通过确保每个基本组件连贯地拼凑在一起，例如清单、钱包、主网区块链等，简化迁移的用户体验。</div>\n<div class=\"mt-3\"><b>下面列出了一些工作细节。</b></div>\n<div class=\"mt-3\"><b>在等待迁移期间对验证检查进行迁移后改进</b></div>\n<div>•迁移后改进了等待迁移期间的验证检查</div>\n<div>•验证先锋的 Pi 可转移余额是否正确</div>\n<div>•验证后，余额可以成功迁移到主网区块链上</div>\n<div>•进一步的验证功能还可以为在完全传输之前需要额外验证的任何人回滚迁移</div>\n<div>钱包调整以促进主网迁移</div>\n<div>•允许在迁移等待期后声明 Pi</div>\n<div>•允许先驱者访问和管理主网迁移过程</div>\n<div>•整个钱包用户界面更新</div>\n<div>主网清单用户体验改进和错误修复，以确保尽可能顺利地过渡到主网</div>\n<div>•多个主网清单用户界面功能和错误修复，例如主网余额仪表板的改进、后端和显示中的数据同步、清单中的添加和修改步骤等。</div>\n<div class=\"mt-3\"><b>迁移后锁定已开发，即将发布</b></div>\n<div>•允许锁定已迁移的 Pi</div>\n<div class=\"mt-3\"><b>KYC解决方案</b></div>\n<div>作为每个先锋主网迁移的先决条件步骤，KYC的工作主要集中在1）提高KYC应用程序的有效性，效率和安全性，2）将KYC扩展到越来越多的先锋，以及3）为已提交申请但尚未收到KYC结果的真正先锋分析和开发解决方案。请参阅此处有关KYC的最新详细更新，了解进度和后续步骤。</div>\n<div class=\"mt-3\"><b>Pi 平台和生态系统 + 社区</b></div>\n<div>我们付出了巨大的努力来促进 Pi 生态系统的增长（封闭网络的两个主要目标之一），以便为 Pi 体验带来更多的实用程序和用例。虽然已经部署或正在开发多个新的基础设施功能，但核心团队正在通过参与黑客马拉松、社区开发支持、外部业务合作伙伴关系和核心团队内部创建的应用程序，在社区和新开发人员之间培养生态系统建设。</div>\n<div class=\"mt-3\"><b>为此，具体的技术和产品工作是：</b></div>\n<div>1.使 SDK 能够连接到 Pi 主网并向 Pi SDK 添加更多功能，允许开发人员在主网上构建更完整、更用户友好的 Pi 应用程序。</div>\n<div>2.鼓励和吸引开发人员参与，并以更具指导性和教育性的方式改善开发人员对 Pi 平台的体验。</div>\n<div>3.为开发商提供基础设施和咨询支持。</div>\n<div class=\"mt-3\"><b>下面列出了有关主要功能的一些详细信息。</b></div>\n<div>在顶尖大学举办的主要黑客马拉松，并计划在 2023 年 1 月初举办更多黑客马拉松，并进一步推出黑客马拉松后计划</div>\n<div>•改进黑客马拉松的开发工作，以构建 Pi 生态系统的实用程序和用例</div>\n<div>•计划从 1 月 9 日开始举办更多正在进行的黑客马拉松</div>\n<div>•开发更多与开发人员相关的计划，以支持黑客马拉松开发人员的持续开发</div>\n<div>•正在开发适用于“应用到先驱者”的其他API，并将在年底或1月初推出。</div>\n<div class=\"mt-3\"><b>主网Pi SDK推出并改进</b></div>\n<div>•允许 Pi 应用程序迁移到主网的重大更新</div>\n<div>•更详细、更清晰的文档 - 链接到 Github 文档</div>\n<div>•此处提供完整的开发人员入门指南（正在进行中）</div>\n<div class=\"mt-3\"><b>开发人员门户更新</b></div>\n<div>•发布新的“创建应用清单”，指导开发人员逐步完成应用创建过程</div>\n<div>•新的仪表板界面，供开发人员更好地管理其 Pi 应用程序</div>\n<div>•部署了演示应用程序，使开发人员能够快速设置自己的 Pi 应用程序</div>\n<div>•使开发人员能够注册主网应用</div>\n<div class=\"mt-3\"><b>Pi 应用引擎 V2 部署</b></div>\n<div>•对于使用 Pi App Engine 在可扩展的服务器基础架构上轻松运行其应用程序的开发人员来说，设置更简单，同时 focu唱歌构建他们的产品和前端功能</div>\n<div>•允许向开发人员提供有关部署的更多反馈</div>\n<div>•总体而言，改进了生态系统中的Pi应用程序开发过程，特别是对于为生态系统做出贡献并且资源较少且对可扩展技术基础架构了解较少的选定团队</div>\n<div class=\"mt-3\"><b>开发者钱包的MVP版本即将发布</b></div>\n<div>•开发人员可以很快创建特定于应用程序的钱包，这些钱包是为支持Pi应用程序操作而不是与个人Pioneer帐户关联的个人钱包用途而量身定制的。</div>\n<div>•该功能计划于 1 月向开发人员提供。</div>\n<div class=\"mt-3\"><b>Pi Chats基础架构更改正在开发中</b></div>\n<div>•Pi Chats后端基础设施将发生重大变化，成为一个更加独立的应用程序，允许更快地开发和部署未来的功能。</div>\n<div>•将减少聊天的压力和对其他服务的影响（过去导致使用中断）</div>\n<div>•将允许将来更轻松地将Pi Chats功能集成到生态系统中</div>\n<div>除了上述技术和产品工作外，在社区和商业方面还做了大量工作，以培养生态系统建设文化，向开发人员介绍和教育 Pi 平台，激励和吸引开发人员在 Pi 上进行构建，并促进和支持开发人员部署 Pi 应用程序。这是构建可行的基于效用的生态系统的基础工作，也是开放网络的重要准备工作。</div>\n<div class=\"mt-3\"><b>展望2023年</b></div>\n<div>该网络在 2022 年见证了重大事件和巨大进展，包括启动大规模 KYC 和主网迁移以及生态系统建设的基础工作。特别是在今年更大的行业动荡背景下，Pi展示了其独特和非共识战略的优势 - Pi的长期愿景以及对逐步构建实质和实用程序的关注。Pi Network不仅能够在行业更大环境的喧嚣中站稳脚跟，而且还在其愿景的指导下朝着其目标稳步前进和增长：“在世界上使用最广泛的加密货币Pi的推动下，建立世界上最具包容性的点对点生态系统和在线体验。</div>\n<div>我们对 2023 年即将发生的事情感到非常兴奋——又是朝着我们实现主网下一个时期的共同目标迈进的一年。去中心化的努力对于建立一个去中心化的网络至关重要，该网络包括区块链、社区和生态系统，具有更完整的基础设施和广泛的公用事业。这种努力不仅仅取决于任何一个小团体，而是所有先驱者共同努力。</div>\n<div>到2023年，将提供更多的沟通和指导，引导先锋参与在生态系统基础设施的主要部分，并进行调整以应对事情发生和生态系统蓬勃发展的阶段，在何处以及如何联合起来进一步发展和发展网络。我们知道您很渴望，我们也是如此。</div>\n<div>干杯，我们祝您新年快乐。让我们一起努力为 Pi 社区带来新的工作、新的创新和新的 Pi 机会。</div>"},{"news_date":"2023/01/02","news_info":"Happy New Year everyone! We’re so excited for Pi Network’s progress going into 2023. Tap \"Update\" to read our recent end-of-year tech and product update that reviews many (but not all) of our significant developments, and emphasizes \"building\" in our Enclosed Network period where any external connectivity or listing is impossible due to the Mainnet firewall. Also remember to only trust official Pi news sources.","content":""},{"news_date":"2023/01/12","news_info":"Pi Network is excited to kick off 2023 by announcing the launch of a new Hackathon! This is along our continued collective efforts to build real utilities for the Pi Ecosystem. Tap “Instructions” for a guide on how to join the Hackathon, and “SDK” for a video workshop where Core Team members guided prospective developers on the basics of how to develop an app on Pi.","content":""},{"news_date":"2023/01/21","news_info":"Nicolas Kokkalis, one of Pi Network’s two founders, wrote a feature article on “Human Powered Identity Verification in the Age of AI.\"","content":"<div>人工智能时代的人力身份验证社区，甚至(尤其是)数字社区，都需要人。 但是你怎么能大规模地证明他们是真实的用户呢? 就 Pi Network 而言，这是一个庞大的全球社区，由世界上分布最广的移动挖掘加密货币提供支持， 秘诀在于平衡高科技与人们的兴趣。 我们通过创建本地 KYC 解决 方案取得了成功。</div>\n<div class=\"mt-3\"><b>在人工智能时代建立加密社区</b></div>\n<div class=\"mt-3\">以太坊、Solana 或 Pi Network 等加密生态系统是由不同参与者组成的社区——从最终用户和开发人员到矿工和验证者。 然而，创建一个繁荣和持久的社区需要大量的技能和资源。 我们已经看到 Facebook 和 Twitter 等传统社交网络使用人工智能算法来扩大用户 群，但这可能会带来问题。</div>\n<div class=\"mt-3\">多年来，Facebook 依靠人工智能算法根据用户的在线偏好和行为对内容进行分类和推荐。 虽然这在一开始运作良好，但仅依靠人工智能算法会导致一系列无法预料的后果:由于将原始参与视为最 高利益的偏⻅，这些算法可能会采取反社会行动，从创建回声室到通过歧视放大人类偏⻅。</div>\n<div class=\"mt-3\">最近，特斯拉首席执行官埃隆·⻢斯克 (Elon Musk) 以 440 亿美元 收购 Twitter 的广为人知的出价在最后一刻被否决，原因是假账户 和垃圾邮件机器人盛行，而缺乏人工验证。 垃圾邮件的绝对数量 让人们考虑到了 Twitter 的整体价值问题:垃圾邮件机器人可能会 增加广告商的浏览量，同时让用户感到沮丧，很明显，手头的人工智能还不够。 这一事件凸显了验证用户以及仔细监控和监督 AI 产品的重要性。</div>\n<div class=\"mt-3\">虽然垃圾邮件机器人和其他因素困扰和破坏了一些在线社区，但我们仍然可以看到有缺陷的社区和人类社区设法煽动的巨大影响。 Reddit 的华尔街赌注志同道合的投机者社区一次又一次地对全球金 融产生影响，所有这些都是围绕真实的人建立的。</div>\n<div class=\"mt-3\">将其视为大规模的图灵测试:公司如何验证他们的用户是真实的?</div>\n<div class=\"mt-3\">遵守更严格的法规验证客户的身份是一个复杂的命题，需要围绕个人数据的可扩展性 和安全性。 对于社交网络和加密应用程序等技术公司来说，更复 杂的问题是需要遵守越来越严格的法规——从用户数据的处理到 KYC 的实施。</div>\n<div class=\"mt-3\">KYC(或“了解你的客户”)要求金融机构在使用其平台之前对其客 户进行例行身份和背景调查，并且是打击洗钱和其他非法活动的更 广泛措施的一部分。 KYC 曾经只与银行业有关，现在越来越多地 要求加密货币领域的公司从交易所和经纪人到钱包提供商和其他服 务。 而且，随着 Web3 的扩展和对奖励数字用户的持续推动，</div>\n<div class=\"mt-3\"><b>KYC 的重要性只会增加。</b></div>\n<div class=\"mt-3\">不幸的是，KYC 的成本对于许多加密货币初创公司来说可能会让 人望而却步。 在考虑了从人工工时和员工雇佣到合规工具及其实 施的价格等多种因素后，公司可能会花费数亿美元进行验证。 即使以每位用户 1.49 美元至 2.05 美元的降低且通常宣传的 KYC 费 率计算，该解决方案对于积累大量用户群来说也根本无法扩展或具 有成本效益。</div>\n<div class=\"mt-3\">此外，KYC 会在新用户入职时产生摩擦，提供新的和繁重的进入 壁垒。 例如，仅在英国，就有四分之一的新申请因 KYC 摩擦而被放弃。</div>\n<div class=\"mt-3\">这揭示了 KYC 的核心讽刺意味:在我们不耐烦的情况下，我们往 往太人性化而无法证明我们的人性。</div>\n<div class=\"mt-3\"><b>解决可扩展的 KYC</b></div>\n<div class=\"mt-3\">为了解决这个 KYC 困境，我们相信以人为本的设计和可扩展的技术将使 Web3 的未来能够透明和公平地补偿用户，同时保持个人匿 名性和法律合规性。</div>\n<div class=\"mt-3\">Pi Network 建立在科学事实和人类真理的综合之上——作为斯坦福大学的博士，您可能对我们抱有同样的期望。</div>\n<div class=\"mt-3\">我们说“科学真理”是因为我们相信我们所做的一切都是为了接近并检验我们在设计、战略和管理方面的假设。 数学的不变事实指导 着我们，我们总是分析经验数据以为下一次迭代提供信息。</div>\n<div class=\"mt-3\">当我们说“人类真理”时，我们反映了这样一个事实，即没有一个项目是凭空建立的:我们所做的一切都是真实的人在真实的地方体验 到的，真实的生活、情感和经历可能会影响他们的感知。 一些人 类真理是基本的; 其他人是可塑的。 我们也在每次迭代中考虑人 类真理和社区需求。</div>\n<div class=\"mt-3\">随着项目的推进，在这些事实之间保持平衡会驱使我们一步步向前。 例如，去中心化是加密网络的一个突出特性，也是 Pi 愿景的重要组成部分，但我们不想仅仅为了去中心化而去中心化。 相反，我们一直在采用渐进式去中心化，基于行业阶段、主流受众的</div>\n<div class=\"mt-3\">准备和意识、区块链技术的实用程序开发以及我们项目的阶段，希望最终实现有意义和可持续的去中心化。</div>\n<div class=\"mt-3\">在 Pi，我们将迭代方法应用于项目的各个方面，从我们的网络级策 略到测试我们移动应用程序中的小产品功能，再到开发代币模型到 工作流程。</div>\n<div class=\"mt-3\">这种区别将我们与一些依赖于他们的人面前的白皮书假设的固定模型区分开来。 相反，我们应用我们的反馈和迭代来通知和改进代 币模型和网络结构——所有这些都是为了更好地满足我们所服务的 人们的需求。</div>\n<div class=\"mt-3\"><b>Pi Network 的社区来源 KYC 解决方案</b></div>\n<div class=\"mt-3\">Pi Network 设计了其原生 KYC 解决方案 Pi KYC，以应对其他第三 方市场解决方案缺乏可扩展性、财务可访问性和全球影响力的问 题。 结合科学和人类真理，Pi KYC 将机器自动化 (AI) 与众包、“超 本地化”人工验证相结合，为其移动平台上已有超过 3500 万全球会 员实现准确高效的 KYC。</div>\n<div class=\"mt-3\">机器自动化负责图像处理、文本提取、假身份证检测、活体检查和图像比较。 同时，人工验证由预先批准的个人处理，他们检查其他成员的 KYC 应用程序的编辑数据，从而防止个人创建虚假账户。</div>\n<div class=\"mt-3\">为了解决可扩展的 KYC 问题，Pi KYC 现在在全球 200 多个国家 (约占全球人口的 92.6%)拥有一支强大、自我维持的人工验证队 伍。 该网络不断扩展，拥有超过 125,000 个受信任的验证器，在 全球范围内验证 KYC 应用程序，他们的努力在 Pi 中得到回报。</div>\n<div class=\"mt-3\">除了防止垃圾邮件帐户和阻止不良行为者外，Pi KYC 还帮助网络遵守法律法规，同时顺畅地发展其繁荣的社区。 在人工智能时代，Pi Network 构建了一个去中心化的可扩展 KYC 解决方案，该 解决方案将机器自动化与众包人工验证相结合，以提供高效且响应迅速的解决方案。</div>\n<div class=\"mt-3\">利用两全其美，Pi KYC 允许网络建立一个合法合规的加密社区， 该社区针对准确性、隐私和全球可访问性进行了优化。 最重要的 是——它真正以人为本。</div>\n<div class=\"mt-3\">事实上，任何企业家都很难知道他们的项目是否或何时会成功，这也适用于我们。 我们所知道的是，Pi 有一个宏伟的愿景，即建立一个基于区块链并由公平分布式加密货币推动的可访问且包容的网络和生态系统。 通过社区的力量，我们每天都更接近实现这一愿景。</div>"},{"news_date":"2023/01/27","news_info":"Pi Network is two weeks into its first 2023 Hackathon! So far, we’ve had 4,377 Hackathon participants on Brainstorm, and a significant number of projects indicated they would use the PiOS license. Interested in joining our collective efforts to build real utilities for the Pi Ecosystem? Tap on “Instructions” to learn how, or “SDK” to watch a video workshop where Core Team members guided prospective developers on the basics of how to develop an app on Pi.","content":"<div result=\"\"><div>人工智能时代的人力身份验证社区，甚至(尤其是)数字社区，都需要人。 但是你怎么能大规模地证明他们是真实的用户呢? 就 Pi Network 而言，这是一个庞大的全球社区，由世界上分布最广的移动挖掘加密货币提供支持， 秘诀在于平衡高科技与人们的兴趣。 我们通过创建本地 KYC 解决 方案取得了成功。</div>\n<div class=\"mt-3\"><b>在人工智能时代建立加密社区</b></div>\n<div class=\"mt-3\">以太坊、Solana 或 Pi Network 等加密生态系统是由不同参与者组成的社区——从最终用户和开发人员到矿工和验证者。 然而，创建一个繁荣和持久的社区需要大量的技能和资源。 我们已经看到 Facebook 和 Twitter 等传统社交网络使用人工智能算法来扩大用户 群，但这可能会带来问题。</div>\n<div class=\"mt-3\">多年来，Facebook 依靠人工智能算法根据用户的在线偏好和行为对内容进行分类和推荐。 虽然这在一开始运作良好，但仅依靠人工智能算法会导致一系列无法预料的后果:由于将原始参与视为最 高利益的偏⻅，这些算法可能会采取反社会行动，从创建回声室到通过歧视放大人类偏⻅。</div>\n<div class=\"mt-3\">最近，特斯拉首席执行官埃隆·⻢斯克 (Elon Musk) 以 440 亿美元 收购 Twitter 的广为人知的出价在最后一刻被否决，原因是假账户 和垃圾邮件机器人盛行，而缺乏人工验证。 垃圾邮件的绝对数量 让人们考虑到了 Twitter 的整体价值问题:垃圾邮件机器人可能会 增加广告商的浏览量，同时让用户感到沮丧，很明显，手头的人工智能还不够。 这一事件凸显了验证用户以及仔细监控和监督 AI 产品的重要性。</div>\n<div class=\"mt-3\">虽然垃圾邮件机器人和其他因素困扰和破坏了一些在线社区，但我们仍然可以看到有缺陷的社区和人类社区设法煽动的巨大影响。 Reddit 的华尔街赌注志同道合的投机者社区一次又一次地对全球金 融产生影响，所有这些都是围绕真实的人建立的。</div>\n<div class=\"mt-3\">将其视为大规模的图灵测试:公司如何验证他们的用户是真实的?</div>\n<div class=\"mt-3\">遵守更严格的法规验证客户的身份是一个复杂的命题，需要围绕个人数据的可扩展性 和安全性。 对于社交网络和加密应用程序等技术公司来说，更复 杂的问题是需要遵守越来越严格的法规——从用户数据的处理到 KYC 的实施。</div>\n<div class=\"mt-3\">KYC(或“了解你的客户”)要求金融机构在使用其平台之前对其客 户进行例行身份和背景调查，并且是打击洗钱和其他非法活动的更 广泛措施的一部分。 KYC 曾经只与银行业有关，现在越来越多地 要求加密货币领域的公司从交易所和经纪人到钱包提供商和其他服 务。 而且，随着 Web3 的扩展和对奖励数字用户的持续推动，</div>\n<div class=\"mt-3\"><b>KYC 的重要性只会增加。</b></div>\n<div class=\"mt-3\">不幸的是，KYC 的成本对于许多加密货币初创公司来说可能会让 人望而却步。 在考虑了从人工工时和员工雇佣到合规工具及其实 施的价格等多种因素后，公司可能会花费数亿美元进行验证。 即使以每位用户 1.49 美元至 2.05 美元的降低且通常宣传的 KYC 费 率计算，该解决方案对于积累大量用户群来说也根本无法扩展或具 有成本效益。</div>\n<div class=\"mt-3\">此外，KYC 会在新用户入职时产生摩擦，提供新的和繁重的进入 壁垒。 例如，仅在英国，就有四分之一的新申请因 KYC 摩擦而被放弃。</div>\n<div class=\"mt-3\">这揭示了 KYC 的核心讽刺意味:在我们不耐烦的情况下，我们往 往太人性化而无法证明我们的人性。</div>\n<div class=\"mt-3\"><b>解决可扩展的 KYC</b></div>\n<div class=\"mt-3\">为了解决这个 KYC 困境，我们相信以人为本的设计和可扩展的技术将使 Web3 的未来能够透明和公平地补偿用户，同时保持个人匿 名性和法律合规性。</div>\n<div class=\"mt-3\">Pi Network 建立在科学事实和人类真理的综合之上——作为斯坦福大学的博士，您可能对我们抱有同样的期望。</div>\n<div class=\"mt-3\">我们说“科学真理”是因为我们相信我们所做的一切都是为了接近并检验我们在设计、战略和管理方面的假设。 数学的不变事实指导 着我们，我们总是分析经验数据以为下一次迭代提供信息。</div>\n<div class=\"mt-3\">当我们说“人类真理”时，我们反映了这样一个事实，即没有一个项目是凭空建立的:我们所做的一切都是真实的人在真实的地方体验 到的，真实的生活、情感和经历可能会影响他们的感知。 一些人 类真理是基本的; 其他人是可塑的。 我们也在每次迭代中考虑人 类真理和社区需求。</div>\n<div class=\"mt-3\">随着项目的推进，在这些事实之间保持平衡会驱使我们一步步向前。 例如，去中心化是加密网络的一个突出特性，也是 Pi 愿景的重要组成部分，但我们不想仅仅为了去中心化而去中心化。 相反，我们一直在采用渐进式去中心化，基于行业阶段、主流受众的</div>\n<div class=\"mt-3\">准备和意识、区块链技术的实用程序开发以及我们项目的阶段，希望最终实现有意义和可持续的去中心化。</div>\n<div class=\"mt-3\">在 Pi，我们将迭代方法应用于项目的各个方面，从我们的网络级策 略到测试我们移动应用程序中的小产品功能，再到开发代币模型到 工作流程。</div>\n<div class=\"mt-3\">这种区别将我们与一些依赖于他们的人面前的白皮书假设的固定模型区分开来。 相反，我们应用我们的反馈和迭代来通知和改进代 币模型和网络结构——所有这些都是为了更好地满足我们所服务的 人们的需求。</div>\n<div class=\"mt-3\"><b>Pi Network 的社区来源 KYC 解决方案</b></div>\n<div class=\"mt-3\">Pi Network 设计了其原生 KYC 解决方案 Pi KYC，以应对其他第三 方市场解决方案缺乏可扩展性、财务可访问性和全球影响力的问 题。 结合科学和人类真理，Pi KYC 将机器自动化 (AI) 与众包、“超 本地化”人工验证相结合，为其移动平台上已有超过 3500 万全球会 员实现准确高效的 KYC。</div>\n<div class=\"mt-3\">机器自动化负责图像处理、文本提取、假身份证检测、活体检查和图像比较。 同时，人工验证由预先批准的个人处理，他们检查其他成员的 KYC 应用程序的编辑数据，从而防止个人创建虚假账户。</div>\n<div class=\"mt-3\">为了解决可扩展的 KYC 问题，Pi KYC 现在在全球 200 多个国家 (约占全球人口的 92.6%)拥有一支强大、自我维持的人工验证队 伍。 该网络不断扩展，拥有超过 125,000 个受信任的验证器，在 全球范围内验证 KYC 应用程序，他们的努力在 Pi 中得到回报。</div>\n<div class=\"mt-3\">除了防止垃圾邮件帐户和阻止不良行为者外，Pi KYC 还帮助网络遵守法律法规，同时顺畅地发展其繁荣的社区。 在人工智能时代，Pi Network 构建了一个去中心化的可扩展 KYC 解决方案，该 解决方案将机器自动化与众包人工验证相结合，以提供高效且响应迅速的解决方案。</div>\n<div class=\"mt-3\">利用两全其美，Pi KYC 允许网络建立一个合法合规的加密社区， 该社区针对准确性、隐私和全球可访问性进行了优化。 最重要的 是——它真正以人为本。</div>\n<div class=\"mt-3\">事实上，任何企业家都很难知道他们的项目是否或何时会成功，这也适用于我们。 我们所知道的是，Pi 有一个宏伟的愿景，即建立一个基于区块链并由公平分布式加密货币推动的可访问且包容的网络和生态系统。 通过社区的力量，我们每天都更接近实现这一愿景。</div></div>"},{"news_date":"2023/02/04","news_info":"Every First Friday of February, we celebrate our annual Moderator Appreciation Day! We thank all Pi moderators for their global volunteer effort to support Pioneers, represent regional communities, translate community content and manage Pi chats. We’re so excited to build Pi together at such an important stage in the Pi journey.","content":""},{"news_date":"2023/02/11","news_info":"As the 2023 Q1 Pi Network Hackathon enters its last few weeks, it is great to see the passion and involvement of the developers community. With over 5,300 participants on the Brainstorm app and many contributions to the optional PiOS program, the Pi community is essential to build utilities during the Enclosed Mainnet phase. It’s not too late to join; if you want to start building your own Pi App, tap “Brainstorm” to learn more and “Workshop” for a product design workshop.","content":""}]